@echo off
rem =====================================================
rem
rem リスト作成BATのサンプル
rem    プロジェクトのトップディレクトリに置いてください
rem
rem    ※sort.exe sed.exeが必要です
rem
rem =====================================================

rem 登録拡張子リスト
set MASK=*.cpp *.h *.s

echo リスト更新
echo ----------------------------------------------------------------------------------------
echo   フォルダー: %~dp0
echo     検索対象: %MASK%
echo     リスト名: %~n0.txt
echo ----------------------------------------------------------------------------------------

rem ドライブ移動
%~d0

rem フォルダー移動
cd %~dp0

rem リスト作成
dir /b /s %MASK% | sort | sed -e "s/^\(.*\\\)\([^\\][^\\]*\)$/\2\/\/\1\2/" > %~n0.txt
echo 完了しました
